'''
ในไฟล์นี้จะเป็นการเรียนรู้เกี่ยวกับตัวดำเนินการทางคณิตศาสตร์ ตัวดำเนินการเปรียบเทียบ และตัวดำเนินการทางตรรกะ
การใช้งานตัวดำเนินการทางคณิตศาสตร์ ตัวดำเนินการเปรียบเทียบ และตัวดำเนินการทางตรรกะ
'''
# ตัวดำเนินการทางคณิตศาสตร์
a = 10; b = 5; c = 9.0; d = 2.0; e = -3.5 # กำหนดค่า
print(a + b) # การบวก
print(a - b) # การลบ
print(a*b) # การคูณ
print(a/c) # การหาร
print(b%d) # การหารเอาเศษ
print(d**a) # ยกกำลัง
print(c//b) # การหารเอาส่วน

# ตัวดำเนินการทางคณิตศาสตร์
a = 10; b = 5; c = 4; d=6; e=7; f=3; g=8 # กำหนดค่า
print(a,b,c,d,e,f,g)

a = b
print(a)# a มีค่าใหม่เท่ากับ b

a += 1 # a = a + 1
print(a) 

b-=1 # b = b - 1 
print(b)  

c *=2 # c = c*2 
print(c) 

d /= 4# d = d/4
print(d) 

e **= 2 # e = e**2
print(e)

f %= 3 # f = f%3
print(f)

g //=2 # g = g//2
print(g)

# ตัวดำเนินการเปรียบเทียบ
a = 10; b = 5; c = 9.0; d = 2.0; e = -3.5 # กำหนดค่า
print(a==b) # เท่ากับ
print(a!=c) # ไม่เท่ากับ
print(a>d) # มากกว่า
print(a>=e) # มากกว่าหรือเท่ากับ
print(e<d) # น้อยกว่า
print(e<=c) # น้อยกว่าหรือเท่ากับ

# ตัวดำเนินการทางตรรกะ
a = True; b = False # กำหนดค่า
print(a and b) # และ
print(a or b) # หรือ
print(not b) # นิเสธ